step-by-step/030-populate-database/020-soap/1400-устройства-в-библиотеке/0100.xml

<?xml version="1.0" ?>
<!-- Создаем устройство в библиотеке устройств -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:deviceUpdate xmlns:common="http://common.bitel.ru"
                          xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                          xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" deviceGroupIds="" deviceTypeId="0" entityId="0" entitySpecId="0" id="-1"
                  ident="SPVID 0800" orderManagerDisabled="false" parentId="1" xsi:type="ns5:invDevice">
                <entityAttributes></entityAttributes>
                <comment></comment>
                <config>
qinq.spvid=800
ip.resource.categoryId=1
vlan.resource.category=1
                </config>
                <host></host>
                <password></password>
                <secret></secret>
                <username></username>
            </arg0>
        </ns5:deviceUpdate>
    </S:Body>
</S:Envelope>